{"keras_version": "2.1.2", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 2, 4], "dtype": "float32", "units": 20, "name": "dense_1", "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 128, "name": "dense_2", "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 64, "name": "dense_3", "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 16, "name": "dense_4", "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 2, "name": "dense_5", "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "trainable": true}}], "backend": "tensorflow"}